perftest/gin_2nd_cache/gin_2nd_cache_getid.txt
[ GET /node/1 200][1]

Summary:
  Total:	60.0151 secs
  Slowest:	0.2029 secs
  Fastest:	0.0007 secs
  Average:	0.0180 secs
  Requests/sec:	2773.4706
  
  Total data:	296613900 bytes
  Size/request:	1782 bytes

Response time histogram:
  0.001 [1]	|
  0.021 [114521]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.041 [40139]	|■■■■■■■■■■■■■■
  0.061 [9005]	|■■■
  0.082 [2121]	|■
  0.102 [524]	|
  0.122 [113]	|
  0.142 [20]	|
  0.162 [2]	|
  0.183 [3]	|
  0.203 [1]	|


Latency distribution:
  10% in 0.0044 secs
  25% in 0.0079 secs
  50% in 0.0142 secs
  75% in 0.0240 secs
  90% in 0.0364 secs
  95% in 0.0460 secs
  99% in 0.0684 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0007 secs, 0.2029 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0055 secs
  resp wait:	0.0179 secs, 0.0006 secs, 0.2029 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0064 secs

Status code distribution:
  [200]	166450 responses



[ GET /node/1 200][2]

Summary:
  Total:	60.0158 secs
  Slowest:	0.1722 secs
  Fastest:	0.0008 secs
  Average:	0.0180 secs
  Requests/sec:	2783.8480
  
  Total data:	297727650 bytes
  Size/request:	1782 bytes

Response time histogram:
  0.001 [1]	|
  0.018 [103018]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.035 [45879]	|■■■■■■■■■■■■■■■■■■
  0.052 [13097]	|■■■■■
  0.069 [3667]	|■
  0.087 [1006]	|
  0.104 [283]	|
  0.121 [86]	|
  0.138 [29]	|
  0.155 [4]	|
  0.172 [5]	|


Latency distribution:
  10% in 0.0045 secs
  25% in 0.0080 secs
  50% in 0.0142 secs
  75% in 0.0239 secs
  90% in 0.0362 secs
  95% in 0.0455 secs
  99% in 0.0669 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0008 secs, 0.1722 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0074 secs
  resp wait:	0.0179 secs, 0.0008 secs, 0.1721 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0070 secs

Status code distribution:
  [200]	167075 responses



[ GET /node/1 200][3]

Summary:
  Total:	60.0202 secs
  Slowest:	0.2214 secs
  Fastest:	0.0007 secs
  Average:	0.0181 secs
  Requests/sec:	2766.3209
  
  Total data:	295874370 bytes
  Size/request:	1782 bytes

Response time histogram:
  0.001 [1]	|
  0.023 [120512]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.045 [36126]	|■■■■■■■■■■■■
  0.067 [7420]	|■■
  0.089 [1528]	|■
  0.111 [338]	|
  0.133 [82]	|
  0.155 [22]	|
  0.177 [2]	|
  0.199 [3]	|
  0.221 [1]	|


Latency distribution:
  10% in 0.0043 secs
  25% in 0.0077 secs
  50% in 0.0140 secs
  75% in 0.0241 secs
  90% in 0.0370 secs
  95% in 0.0466 secs
  99% in 0.0697 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0007 secs, 0.2214 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0062 secs
  resp wait:	0.0180 secs, 0.0007 secs, 0.2214 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0057 secs

Status code distribution:
  [200]	166035 responses



[ GET /node/1 200][4]

Summary:
  Total:	60.0143 secs
  Slowest:	0.1622 secs
  Fastest:	0.0007 secs
  Average:	0.0177 secs
  Requests/sec:	2818.0790
  
  Total data:	301380750 bytes
  Size/request:	1782 bytes

Response time histogram:
  0.001 [1]	|
  0.017 [100491]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.033 [47595]	|■■■■■■■■■■■■■■■■■■■
  0.049 [14681]	|■■■■■■
  0.065 [4415]	|■■
  0.081 [1389]	|■
  0.098 [380]	|
  0.114 [113]	|
  0.130 [47]	|
  0.146 [9]	|
  0.162 [4]	|


Latency distribution:
  10% in 0.0044 secs
  25% in 0.0078 secs
  50% in 0.0139 secs
  75% in 0.0236 secs
  90% in 0.0359 secs
  95% in 0.0453 secs
  99% in 0.0672 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0007 secs, 0.1622 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0104 secs
  resp wait:	0.0177 secs, 0.0007 secs, 0.1621 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0073 secs

Status code distribution:
  [200]	169125 responses



[ GET /node/1 200][5]

Summary:
  Total:	60.0156 secs
  Slowest:	0.2147 secs
  Fastest:	0.0007 secs
  Average:	0.0177 secs
  Requests/sec:	2817.6825
  
  Total data:	301345110 bytes
  Size/request:	1782 bytes

Response time histogram:
  0.001 [1]	|
  0.022 [122075]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.044 [37698]	|■■■■■■■■■■■■
  0.065 [7478]	|■■
  0.086 [1527]	|■
  0.108 [260]	|
  0.129 [53]	|
  0.150 [10]	|
  0.172 [2]	|
  0.193 [0]	|
  0.215 [1]	|


Latency distribution:
  10% in 0.0044 secs
  25% in 0.0079 secs
  50% in 0.0141 secs
  75% in 0.0236 secs
  90% in 0.0357 secs
  95% in 0.0449 secs
  99% in 0.0662 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0007 secs, 0.2147 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0055 secs
  resp wait:	0.0177 secs, 0.0007 secs, 0.2146 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0059 secs

Status code distribution:
  [200]	169105 responses



[ GET /node/1 400][1]

Summary:
  Total:	60.0157 secs
  Slowest:	0.2021 secs
  Fastest:	0.0007 secs
  Average:	0.0176 secs
  Requests/sec:	2835.7229
  
  Total data:	303275016 bytes
  Size/request:	1782 bytes

Response time histogram:
  0.001 [1]	|
  0.021 [118448]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.041 [40302]	|■■■■■■■■■■■■■■
  0.061 [8918]	|■■■
  0.081 [1962]	|■
  0.101 [424]	|
  0.122 [109]	|
  0.142 [18]	|
  0.162 [4]	|
  0.182 [0]	|
  0.202 [2]	|


Latency distribution:
  10% in 0.0043 secs
  25% in 0.0077 secs
  50% in 0.0138 secs
  75% in 0.0235 secs
  90% in 0.0357 secs
  95% in 0.0450 secs
  99% in 0.0665 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0007 secs, 0.2021 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0068 secs
  resp wait:	0.0175 secs, 0.0006 secs, 0.2020 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0093 secs

Status code distribution:
  [200]	170188 responses



[ GET /node/1 400][2]

Summary:
  Total:	60.0155 secs
  Slowest:	0.1793 secs
  Fastest:	0.0008 secs
  Average:	0.0177 secs
  Requests/sec:	2818.6563
  
  Total data:	301448466 bytes
  Size/request:	1782 bytes

Response time histogram:
  0.001 [1]	|
  0.019 [108790]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.036 [43964]	|■■■■■■■■■■■■■■■■
  0.054 [11957]	|■■■■
  0.072 [3196]	|■
  0.090 [937]	|
  0.108 [243]	|
  0.126 [52]	|
  0.144 [15]	|
  0.161 [5]	|
  0.179 [3]	|


Latency distribution:
  10% in 0.0043 secs
  25% in 0.0077 secs
  50% in 0.0139 secs
  75% in 0.0236 secs
  90% in 0.0361 secs
  95% in 0.0455 secs
  99% in 0.0679 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0008 secs, 0.1793 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0054 secs
  resp wait:	0.0177 secs, 0.0007 secs, 0.1792 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0109 secs

Status code distribution:
  [200]	169163 responses



[ GET /node/1 400][3]

Summary:
  Total:	60.0163 secs
  Slowest:	0.1588 secs
  Fastest:	0.0006 secs
  Average:	0.0177 secs
  Requests/sec:	2822.3143
  
  Total data:	301844070 bytes
  Size/request:	1782 bytes

Response time histogram:
  0.001 [1]	|
  0.016 [98093]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.032 [49180]	|■■■■■■■■■■■■■■■■■■■■
  0.048 [15457]	|■■■■■■
  0.064 [4650]	|■■
  0.080 [1405]	|■
  0.096 [421]	|
  0.111 [116]	|
  0.127 [35]	|
  0.143 [21]	|
  0.159 [6]	|


Latency distribution:
  10% in 0.0044 secs
  25% in 0.0078 secs
  50% in 0.0140 secs
  75% in 0.0236 secs
  90% in 0.0357 secs
  95% in 0.0449 secs
  99% in 0.0663 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0006 secs, 0.1588 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0054 secs
  resp wait:	0.0176 secs, 0.0006 secs, 0.1588 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0093 secs

Status code distribution:
  [200]	169385 responses



[ GET /node/1 400][4]

Summary:
  Total:	60.0162 secs
  Slowest:	0.1652 secs
  Fastest:	0.0007 secs
  Average:	0.0177 secs
  Requests/sec:	2817.8557
  
  Total data:	301366494 bytes
  Size/request:	1782 bytes

Response time histogram:
  0.001 [1]	|
  0.017 [101790]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.034 [46857]	|■■■■■■■■■■■■■■■■■■
  0.050 [14486]	|■■■■■■
  0.067 [4208]	|■■
  0.083 [1257]	|
  0.099 [373]	|
  0.116 [105]	|
  0.132 [24]	|
  0.149 [11]	|
  0.165 [5]	|


Latency distribution:
  10% in 0.0043 secs
  25% in 0.0077 secs
  50% in 0.0139 secs
  75% in 0.0236 secs
  90% in 0.0361 secs
  95% in 0.0454 secs
  99% in 0.0672 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0007 secs, 0.1652 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0057 secs
  resp wait:	0.0177 secs, 0.0006 secs, 0.1651 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0097 secs

Status code distribution:
  [200]	169117 responses



[ GET /node/1 400][5]

Summary:
  Total:	60.0163 secs
  Slowest:	0.1698 secs
  Fastest:	0.0007 secs
  Average:	0.0178 secs
  Requests/sec:	2814.8014
  
  Total data:	301040388 bytes
  Size/request:	1782 bytes

Response time histogram:
  0.001 [1]	|
  0.018 [103575]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.035 [46492]	|■■■■■■■■■■■■■■■■■■
  0.051 [13547]	|■■■■■
  0.068 [3816]	|■
  0.085 [1067]	|
  0.102 [314]	|
  0.119 [98]	|
  0.136 [18]	|
  0.153 [4]	|
  0.170 [2]	|


Latency distribution:
  10% in 0.0044 secs
  25% in 0.0079 secs
  50% in 0.0140 secs
  75% in 0.0236 secs
  90% in 0.0360 secs
  95% in 0.0452 secs
  99% in 0.0669 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0007 secs, 0.1698 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0093 secs
  resp wait:	0.0177 secs, 0.0006 secs, 0.1697 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0093 secs

Status code distribution:
  [200]	168934 responses



[ GET /node/1 600][1]

Summary:
  Total:	60.0149 secs
  Slowest:	0.1620 secs
  Fastest:	0.0008 secs
  Average:	0.0177 secs
  Requests/sec:	2824.6659
  
  Total data:	302088204 bytes
  Size/request:	1782 bytes

Response time histogram:
  0.001 [1]	|
  0.017 [100600]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.033 [48020]	|■■■■■■■■■■■■■■■■■■■
  0.049 [14654]	|■■■■■■
  0.065 [4354]	|■■
  0.081 [1319]	|■
  0.098 [396]	|
  0.114 [128]	|
  0.130 [36]	|
  0.146 [8]	|
  0.162 [6]	|


Latency distribution:
  10% in 0.0044 secs
  25% in 0.0078 secs
  50% in 0.0139 secs
  75% in 0.0235 secs
  90% in 0.0359 secs
  95% in 0.0452 secs
  99% in 0.0668 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0008 secs, 0.1620 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0064 secs
  resp wait:	0.0176 secs, 0.0007 secs, 0.1620 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0248 secs

Status code distribution:
  [200]	169522 responses



[ GET /node/1 600][2]

Summary:
  Total:	60.0151 secs
  Slowest:	0.1534 secs
  Fastest:	0.0008 secs
  Average:	0.0177 secs
  Requests/sec:	2831.0550
  
  Total data:	302772492 bytes
  Size/request:	1782 bytes

Response time histogram:
  0.001 [1]	|
  0.016 [96757]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.031 [49480]	|■■■■■■■■■■■■■■■■■■■■
  0.047 [16235]	|■■■■■■■
  0.062 [5039]	|■■
  0.077 [1637]	|■
  0.092 [527]	|
  0.108 [161]	|
  0.123 [52]	|
  0.138 [12]	|
  0.153 [5]	|


Latency distribution:
  10% in 0.0044 secs
  25% in 0.0078 secs
  50% in 0.0139 secs
  75% in 0.0234 secs
  90% in 0.0357 secs
  95% in 0.0448 secs
  99% in 0.0664 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0008 secs, 0.1534 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0144 secs
  resp wait:	0.0176 secs, 0.0007 secs, 0.1533 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0090 secs

Status code distribution:
  [200]	169906 responses



[ GET /node/1 600][3]

Summary:
  Total:	60.0151 secs
  Slowest:	0.1567 secs
  Fastest:	0.0007 secs
  Average:	0.0176 secs
  Requests/sec:	2834.8679
  
  Total data:	303180570 bytes
  Size/request:	1782 bytes

Response time histogram:
  0.001 [1]	|
  0.016 [98478]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.032 [49158]	|■■■■■■■■■■■■■■■■■■■■
  0.048 [15601]	|■■■■■■
  0.063 [4780]	|■■
  0.079 [1448]	|■
  0.094 [455]	|
  0.110 [155]	|
  0.125 [41]	|
  0.141 [12]	|
  0.157 [6]	|


Latency distribution:
  10% in 0.0044 secs
  25% in 0.0078 secs
  50% in 0.0139 secs
  75% in 0.0235 secs
  90% in 0.0357 secs
  95% in 0.0449 secs
  99% in 0.0662 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0007 secs, 0.1567 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0053 secs
  resp wait:	0.0176 secs, 0.0007 secs, 0.1566 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0068 secs

Status code distribution:
  [200]	170135 responses



[ GET /node/1 600][4]

Summary:
  Total:	60.0158 secs
  Slowest:	0.1544 secs
  Fastest:	0.0007 secs
  Average:	0.0176 secs
  Requests/sec:	2836.5677
  
  Total data:	303365898 bytes
  Size/request:	1782 bytes

Response time histogram:
  0.001 [1]	|
  0.016 [97393]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.031 [49437]	|■■■■■■■■■■■■■■■■■■■■
  0.047 [16066]	|■■■■■■■
  0.062 [5060]	|■■
  0.078 [1582]	|■
  0.093 [495]	|
  0.108 [138]	|
  0.124 [48]	|
  0.139 [14]	|
  0.154 [5]	|


Latency distribution:
  10% in 0.0044 secs
  25% in 0.0077 secs
  50% in 0.0139 secs
  75% in 0.0235 secs
  90% in 0.0357 secs
  95% in 0.0449 secs
  99% in 0.0660 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0007 secs, 0.1544 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0054 secs
  resp wait:	0.0175 secs, 0.0007 secs, 0.1543 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0088 secs

Status code distribution:
  [200]	170239 responses



[ GET /node/1 600][5]

Summary:
  Total:	60.0143 secs
  Slowest:	0.1742 secs
  Fastest:	0.0008 secs
  Average:	0.0176 secs
  Requests/sec:	2832.2600
  
  Total data:	302897232 bytes
  Size/request:	1782 bytes

Response time histogram:
  0.001 [1]	|
  0.018 [107174]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.035 [45452]	|■■■■■■■■■■■■■■■■■
  0.053 [12678]	|■■■■■
  0.070 [3412]	|■
  0.088 [923]	|
  0.105 [252]	|
  0.122 [62]	|
  0.140 [14]	|
  0.157 [6]	|
  0.174 [2]	|


Latency distribution:
  10% in 0.0044 secs
  25% in 0.0078 secs
  50% in 0.0139 secs
  75% in 0.0236 secs
  90% in 0.0357 secs
  95% in 0.0450 secs
  99% in 0.0662 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0008 secs, 0.1742 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0071 secs
  resp wait:	0.0176 secs, 0.0007 secs, 0.1742 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0095 secs

Status code distribution:
  [200]	169976 responses



[ GET /node/1 800][1]

Summary:
  Total:	60.0150 secs
  Slowest:	0.1567 secs
  Fastest:	0.0007 secs
  Average:	0.0178 secs
  Requests/sec:	2814.3984
  
  Total data:	300990492 bytes
  Size/request:	1782 bytes

Response time histogram:
  0.001 [1]	|
  0.016 [97121]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.032 [48855]	|■■■■■■■■■■■■■■■■■■■■
  0.048 [15793]	|■■■■■■■
  0.063 [4886]	|■■
  0.079 [1532]	|■
  0.094 [490]	|
  0.110 [145]	|
  0.125 [59]	|
  0.141 [15]	|
  0.157 [9]	|


Latency distribution:
  10% in 0.0044 secs
  25% in 0.0078 secs
  50% in 0.0140 secs
  75% in 0.0236 secs
  90% in 0.0360 secs
  95% in 0.0452 secs
  99% in 0.0673 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0007 secs, 0.1567 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0056 secs
  resp wait:	0.0177 secs, 0.0006 secs, 0.1566 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0096 secs

Status code distribution:
  [200]	168906 responses



[ GET /node/1 800][2]

Summary:
  Total:	60.0152 secs
  Slowest:	0.1596 secs
  Fastest:	0.0008 secs
  Average:	0.0178 secs
  Requests/sec:	2806.9742
  
  Total data:	300197502 bytes
  Size/request:	1782 bytes

Response time histogram:
  0.001 [1]	|
  0.017 [98546]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.033 [47976]	|■■■■■■■■■■■■■■■■■■■
  0.048 [15154]	|■■■■■■
  0.064 [4714]	|■■
  0.080 [1456]	|■
  0.096 [403]	|
  0.112 [158]	|
  0.128 [39]	|
  0.144 [10]	|
  0.160 [4]	|


Latency distribution:
  10% in 0.0044 secs
  25% in 0.0078 secs
  50% in 0.0140 secs
  75% in 0.0237 secs
  90% in 0.0361 secs
  95% in 0.0456 secs
  99% in 0.0670 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0008 secs, 0.1596 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0067 secs
  resp wait:	0.0177 secs, 0.0007 secs, 0.1594 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0075 secs

Status code distribution:
  [200]	168461 responses



[ GET /node/1 800][3]

Summary:
  Total:	60.0156 secs
  Slowest:	0.1653 secs
  Fastest:	0.0006 secs
  Average:	0.0179 secs
  Requests/sec:	2794.0088
  
  Total data:	298812888 bytes
  Size/request:	1782 bytes

Response time histogram:
  0.001 [1]	|
  0.017 [99676]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.034 [47402]	|■■■■■■■■■■■■■■■■■■■
  0.050 [14451]	|■■■■■■
  0.066 [4330]	|■■
  0.083 [1235]	|
  0.099 [390]	|
  0.116 [140]	|
  0.132 [41]	|
  0.149 [15]	|
  0.165 [3]	|


Latency distribution:
  10% in 0.0043 secs
  25% in 0.0078 secs
  50% in 0.0140 secs
  75% in 0.0238 secs
  90% in 0.0364 secs
  95% in 0.0458 secs
  99% in 0.0676 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0006 secs, 0.1653 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0054 secs
  resp wait:	0.0178 secs, 0.0005 secs, 0.1652 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0086 secs

Status code distribution:
  [200]	167684 responses



[ GET /node/1 800][4]

Summary:
  Total:	60.0164 secs
  Slowest:	0.2412 secs
  Fastest:	0.0007 secs
  Average:	0.0178 secs
  Requests/sec:	2804.3189
  
  Total data:	299919510 bytes
  Size/request:	1782 bytes

Response time histogram:
  0.001 [1]	|
  0.025 [129267]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.049 [32667]	|■■■■■■■■■■
  0.073 [5298]	|■■
  0.097 [906]	|
  0.121 [141]	|
  0.145 [22]	|
  0.169 [2]	|
  0.193 [0]	|
  0.217 [0]	|
  0.241 [1]	|


Latency distribution:
  10% in 0.0044 secs
  25% in 0.0079 secs
  50% in 0.0140 secs
  75% in 0.0238 secs
  90% in 0.0361 secs
  95% in 0.0452 secs
  99% in 0.0667 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0007 secs, 0.2412 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0073 secs
  resp wait:	0.0177 secs, 0.0007 secs, 0.2411 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0087 secs

Status code distribution:
  [200]	168305 responses



[ GET /node/1 800][5]

Summary:
  Total:	60.0149 secs
  Slowest:	0.1576 secs
  Fastest:	0.0007 secs
  Average:	0.0178 secs
  Requests/sec:	2815.5024
  
  Total data:	301108104 bytes
  Size/request:	1782 bytes

Response time histogram:
  0.001 [1]	|
  0.016 [97476]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.032 [48929]	|■■■■■■■■■■■■■■■■■■■■
  0.048 [15781]	|■■■■■■
  0.063 [4689]	|■■
  0.079 [1452]	|■
  0.095 [456]	|
  0.111 [127]	|
  0.126 [42]	|
  0.142 [9]	|
  0.158 [10]	|


Latency distribution:
  10% in 0.0044 secs
  25% in 0.0079 secs
  50% in 0.0140 secs
  75% in 0.0236 secs
  90% in 0.0359 secs
  95% in 0.0450 secs
  99% in 0.0664 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0007 secs, 0.1576 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0061 secs
  resp wait:	0.0177 secs, 0.0007 secs, 0.1575 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0096 secs

Status code distribution:
  [200]	168972 responses



[ GET /node/1 1000][1]

Summary:
  Total:	60.0161 secs
  Slowest:	0.1737 secs
  Fastest:	0.0006 secs
  Average:	0.0178 secs
  Requests/sec:	2801.0334
  
  Total data:	299566674 bytes
  Size/request:	1782 bytes

Response time histogram:
  0.001 [1]	|
  0.018 [103973]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.035 [46240]	|■■■■■■■■■■■■■■■■■■
  0.053 [12966]	|■■■■■
  0.070 [3611]	|■
  0.087 [944]	|
  0.104 [268]	|
  0.122 [73]	|
  0.139 [22]	|
  0.156 [6]	|
  0.174 [3]	|


Latency distribution:
  10% in 0.0044 secs
  25% in 0.0079 secs
  50% in 0.0141 secs
  75% in 0.0238 secs
  90% in 0.0360 secs
  95% in 0.0454 secs
  99% in 0.0666 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0006 secs, 0.1737 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0094 secs
  resp wait:	0.0178 secs, 0.0006 secs, 0.1736 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0073 secs

Status code distribution:
  [200]	168107 responses



[ GET /node/1 1000][2]

Summary:
  Total:	60.0168 secs
  Slowest:	0.2183 secs
  Fastest:	0.0008 secs
  Average:	0.0177 secs
  Requests/sec:	2818.2461
  
  Total data:	301411044 bytes
  Size/request:	1782 bytes

Response time histogram:
  0.001 [1]	|
  0.023 [123500]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.044 [36696]	|■■■■■■■■■■■■
  0.066 [7192]	|■■
  0.088 [1417]	|
  0.110 [268]	|
  0.131 [55]	|
  0.153 [11]	|
  0.175 [1]	|
  0.197 [0]	|
  0.218 [1]	|


Latency distribution:
  10% in 0.0044 secs
  25% in 0.0079 secs
  50% in 0.0140 secs
  75% in 0.0236 secs
  90% in 0.0358 secs
  95% in 0.0450 secs
  99% in 0.0665 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0008 secs, 0.2183 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0058 secs
  resp wait:	0.0177 secs, 0.0007 secs, 0.2182 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0072 secs

Status code distribution:
  [200]	169142 responses



[ GET /node/1 1000][3]

Summary:
  Total:	60.0283 secs
  Slowest:	0.1667 secs
  Fastest:	0.0008 secs
  Average:	0.0179 secs
  Requests/sec:	2786.8507
  
  Total data:	298110780 bytes
  Size/request:	1782 bytes

Response time histogram:
  0.001 [1]	|
  0.017 [101282]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.034 [45743]	|■■■■■■■■■■■■■■■■■■
  0.051 [14086]	|■■■■■■
  0.067 [4291]	|■■
  0.084 [1280]	|■
  0.100 [391]	|
  0.117 [153]	|
  0.134 [44]	|
  0.150 [14]	|
  0.167 [5]	|


Latency distribution:
  10% in 0.0042 secs
  25% in 0.0076 secs
  50% in 0.0140 secs
  75% in 0.0239 secs
  90% in 0.0367 secs
  95% in 0.0463 secs
  99% in 0.0689 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0008 secs, 0.1667 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0077 secs
  resp wait:	0.0179 secs, 0.0007 secs, 0.1666 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0090 secs

Status code distribution:
  [200]	167290 responses



[ GET /node/1 1000][4]

Summary:
  Total:	60.0160 secs
  Slowest:	0.1794 secs
  Fastest:	0.0008 secs
  Average:	0.0177 secs
  Requests/sec:	2829.0967
  
  Total data:	302567562 bytes
  Size/request:	1782 bytes

Response time histogram:
  0.001 [1]	|
  0.019 [108848]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.037 [44948]	|■■■■■■■■■■■■■■■■■
  0.054 [11908]	|■■■■
  0.072 [3022]	|■
  0.090 [786]	|
  0.108 [210]	|
  0.126 [50]	|
  0.144 [14]	|
  0.162 [3]	|
  0.179 [1]	|


Latency distribution:
  10% in 0.0044 secs
  25% in 0.0078 secs
  50% in 0.0139 secs
  75% in 0.0235 secs
  90% in 0.0357 secs
  95% in 0.0448 secs
  99% in 0.0662 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0008 secs, 0.1794 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0063 secs
  resp wait:	0.0176 secs, 0.0007 secs, 0.1794 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0064 secs

Status code distribution:
  [200]	169791 responses



[ GET /node/1 1000][5]

Summary:
  Total:	60.0160 secs
  Slowest:	0.1556 secs
  Fastest:	0.0008 secs
  Average:	0.0177 secs
  Requests/sec:	2823.8976
  
  Total data:	302011578 bytes
  Size/request:	1782 bytes

Response time histogram:
  0.001 [1]	|
  0.016 [97681]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.032 [48719]	|■■■■■■■■■■■■■■■■■■■■
  0.047 [15648]	|■■■■■■
  0.063 [5020]	|■■
  0.078 [1621]	|■
  0.094 [562]	|
  0.109 [151]	|
  0.125 [53]	|
  0.140 [15]	|
  0.156 [8]	|


Latency distribution:
  10% in 0.0043 secs
  25% in 0.0077 secs
  50% in 0.0139 secs
  75% in 0.0235 secs
  90% in 0.0359 secs
  95% in 0.0454 secs
  99% in 0.0678 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0008 secs, 0.1556 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0054 secs
  resp wait:	0.0176 secs, 0.0007 secs, 0.1555 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0091 secs

Status code distribution:
  [200]	169479 responses